ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    /*
        - EDITAR HORARIO 1 -
        Past. Actual:  P1 
        Nuevo Past. :  Px 
        Past:[1-4] Volver:*
    */
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("- EDITAR HORARIO _ -");
    LCD_I2C_SetCursor(1,17);
    LCD_I2C_WriteUInt8(horario_selecionado,1);
    
    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Past. Actual:  P_");
    LCD_I2C_SetCursor(2,16);
    dato_memoria = EEPROM_ReadByte(13+(5*(horario_selecionado-1))); // Pastillero actual
    LCD_I2C_WriteUInt8(dato_memoria,1);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Nuevo Past. :  Px");
    
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("Past:[1-4] Volver:*");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /* Pastilleros válidos */
            case '1':
            case '2':
            case '3':
            case '4':
                pastillero_modificado = tecla - '0';
                LCD_I2C_SetCursor(3,16);
                LCD_I2C_WriteChar(tecla);
                __delay_ms(500);
                break; // <-- BREAK AÑADIDO AQUI
                
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }
    
    /* Confirmación de guardado de pastillero */
    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("[#]Guardar [*]Salir");
    
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '#':

                Buzzer_ButtonClick(&buzzer1);
                __delay_ms(500);
                break;

            /* Cancelar operación */
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /* Cualquier otra tecla es inválida */
            default:

                Buzzer_WarningSound(&buzzer1);
                tecla = KEYPAD_NO_KEY;
        }

        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*----------------------------------------------------------------------
     * Guardar datos actualizados en EEPROM.
     *----------------------------------------------------------------------*/
    
    EEPROM_UpdateByte(9+(5*(horario_selecionado-1)), (hora_modificada[0]*10)+hora_modificada[1]);
    EEPROM_UpdateByte(10+(5*(horario_selecionado-1)), (hora_modificada[2]*10)+hora_modificada[3]);
    EEPROM_UpdateByte(13+(5*(horario_selecionado-1)), pastillero_modificado);
    EEPROM_UpdateByte(11+(5*(horario_selecionado-1)), 0);
    
    /*----------------------------------------------------------------------
     * Mensaje de confirmación final.
     *----------------------------------------------------------------------*/

    /*
       --------------------
        HORARIO ACTUALIZADO
         P1 a las 12:00   
       -------------------- 
    */
    
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("--------------------");

    LCD_I2C_SetCursor(2,1);
    LCD_I2C_WriteString("HORARIO ACTUALIZADO");

    LCD_I2C_SetCursor(3,2);
    LCD_I2C_WriteString("P_ a las __:__");
    
    LCD_I2C_SetCursor(3,3);
    dato_memoria = EEPROM_ReadByte(13 + ((horario_selecionado-1) * 5));
    LCD_I2C_WriteUInt8(dato_memoria,1);
    
    LCD_I2C_SetCursor(3,11);
    dato_memoria = EEPROM_ReadByte(9 + ((horario_selecionado-1) * 5));
    LCD_I2C_WriteUInt8(dato_memoria,2);
    
    LCD_I2C_SetCursor(3,14);
    dato_memoria = EEPROM_ReadByte(10 + ((horario_selecionado-1) * 5));
    LCD_I2C_WriteUInt8(dato_memoria,2);

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("--------------------");

    __delay_ms(2000);
}
/*
 * ============================================================================
 * FUNCIÓN: SubProceso_AgregarHorario
 * ============================================================================
 * Permite registrar un nuevo horario de dispensación de medicamentos.
 *
 * Flujo:
 *  1. Verifica que aún exista espacio para almacenar horarios.
 *  2. Solicita el número de pastillero (1-4).
 *  3. Solicita la hora en formato 24 horas (HHMM).
 *  4. Espera la confirmación del usuario.
 *  5. Guarda el horario en la EEPROM.
 *  6. Muestra un mensaje de confirmación.
 * ============================================================================
 */
void SubProceso_AgregarHorario(void)
{
    /*
     * Variables locales
     */
    uint8_t pastillero_selecionado;
    uint8_t index_horarios_ocupados;
    uint8_t hora[4] = {};

    /*----------------------------------------------------------------------
     * Verificar si existe espacio disponible para nuevos horarios.
     *----------------------------------------------------------------------*/
    if (EEPROM_ReadByte(1) >= 6)
    {
        LCD_I2C_Clear();
        LCD_I2C_SetCursor(2,3);
        LCD_I2C_WriteString("Horarios llenos");
        return;
    }

    /* Obtener la cantidad de horarios actualmente almacenados */
    index_horarios_ocupados = EEPROM_ReadByte(1);

    /*----------------------------------------------------------------------
     * Selección del pastillero.
     *----------------------------------------------------------------------*/

    /*
        -- NUEVO HORARIO ---
        Asignar pastillero:
        Numero (1-4): [ ]
        [*] Salir
    */

    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString("-- NUEVO HORARIO ---");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("Asignar pastillero:");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Numero (1-4): [ ]");

    LCD_I2C_SetCursor(4,11);
    LCD_I2C_WriteString("[*] Salir");

    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /* Pastilleros válidos */
            case '1':
            case '2':
            case '3':
            case '4':

                Buzzer_ButtonClick(&buzzer1);

                pastillero_selecionado = tecla - '0';

                LCD_I2C_SetCursor(3,15);
                LCD_I2C_WriteChar(tecla);

