ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
    EEPROM_UpdateByte(10 + ((horario) * 5),min);

    EEPROM_UpdateByte(13 + ((horario) * 5),pastillero);

    /* Actualizar cantidad de horarios almacenados */
    EEPROM_UpdateByte(1, (horario) + 1);
}
/******************************************************************************
 * Función: SubProceso_RegistrarPastillas
 *----------------------------------------------------------------------------
 * Permite registrar una recarga de pastillas en uno de los cuatro
 * compartimientos disponibles.
 *
 * Flujo:
 *   1. Lee el stock total almacenado en EEPROM.
 *   2. Verifica que los datos sean válidos.
 *   3. Muestra el stock actual de cada pastillero.
 *   4. Permite seleccionar el compartimiento (1-4).
 *   5. Solicita la cantidad de pastillas a agregar.
 *   6. Guarda la nueva información al confirmar con '#'.
 *
 * Controles:
 *   1-4 -> Seleccionar pastillero.
 *   0-9 -> Cantidad a agregar.
 *   #   -> Guardar cambios.
 *   *   -> Cancelar operación.
 ******************************************************************************/
void SubProceso_RegistrarPastillas(void)
{
    uint8_t pastillero_selecionado;
    uint8_t cantidad_a_sumar = 0;

    /*==============================================================
     * Leer stock total de pastillas
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,1);
    LCD_I2C_WriteString("REG. CANT. PASTILLAS");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Leyendo Memoria");

    dato_memoria = EEPROM_ReadByte(2);

    MostrarAnimacionCarga(4,0);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Extrayendo Datos");

    MostrarAnimacionCarga(4,4);

    /*==============================================================
     * Validar datos leídos
     *==============================================================*/
    if (dato_memoria == 0xFF)
    {
        MostrarAnimacionCarga(4,8);

        LCD_I2C_SetCursor(3,0);
        LCD_I2C_ClearFile();

        LCD_I2C_SetCursor(3,2);
        LCD_I2C_WriteString("Datos Corruptos");

        __delay_ms(1500);
        return;
    }

    /*==============================================================
     * Mostrar stock total disponible
     *==============================================================*/
    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Pastillas disp: ");
    LCD_I2C_WriteUInt8(dato_memoria,2);

    MostrarAnimacionCarga(4,8);

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_ClearFile();

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("Preparando sistema..");

    MostrarAnimacionCarga(4,12);

    /*==============================================================
     * Mostrar stock individual de cada pastillero
     *==============================================================*/
    LCD_I2C_Clear();

    LCD_I2C_SetCursor(1,0);
    LCD_I2C_WriteString(" STOCK PASTILLEROS ");

    LCD_I2C_SetCursor(2,0);
    LCD_I2C_WriteString("P1:[");
    dato_memoria = EEPROM_ReadByte(5);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]      P2:[");

    dato_memoria = EEPROM_ReadByte(6);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");

    LCD_I2C_SetCursor(3,0);
    LCD_I2C_WriteString("P3:[");

    dato_memoria = EEPROM_ReadByte(7);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]      P4:[");

    dato_memoria = EEPROM_ReadByte(8);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");

    LCD_I2C_SetCursor(4,0);
    LCD_I2C_WriteString("Seleccione (1-4):[ ]");

    /*==============================================================
     * Esperar la selección del pastillero
     *==============================================================*/
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            case '1':
            case '2':
            case '3':
            case '4':

                Buzzer_ButtonClick(&buzzer1);

                pastillero_selecionado = tecla - '0';

                LCD_I2C_SetCursor(4,18);
                LCD_I2C_WriteChar(tecla);

                __delay_ms(50);

                Detallar_CantPastillas(pastillero_selecionado);

                break;

            default:

                Buzzer_WarningSound(&buzzer1);

                LCD_I2C_SetCursor(4,18);
                LCD_I2C_WriteString("-");

                tecla = KEYPAD_NO_KEY;
        }

        /* Salir únicamente cuando la selección sea válida */
        if (tecla != KEYPAD_NO_KEY)
            break;
    }

    /*==============================================================
     * Esperar la cantidad de pastillas a registrar
     *==============================================================*/
    while (1)
    {
        tecla = KEYPAD_NO_KEY;

        while (tecla == KEYPAD_NO_KEY)
        {
            tecla = Keypad_Read(&teclado);
            __delay_ms(20);
        }

        switch (tecla)
        {
            /*------------------------------------------
             * Teclas sin función en esta pantalla
             *-----------------------------------------*/
            case 'A':
            case 'B':
            case 'C':
            case 'D':

                Buzzer_WarningSound(&buzzer1);
                break;

            /*------------------------------------------
             * Cancelar operación
             *-----------------------------------------*/
            case '*':

                Buzzer_ButtonClick(&buzzer1);
                return;

            /*------------------------------------------
             * Confirmar y guardar datos
             *-----------------------------------------*/
            case '#':

                Buzzer_CorrectSound(&buzzer1);

