ANGELLH2000/Dispensador-Automatico-con-PIC18F57Q43/TF-Micro.X/funcionesGenerales.c
                Guardar_CantPastillas(pastillero_selecionado,cantidad_a_sumar);
                __delay_ms(200);

                return;

            /*------------------------------------------
             * Registrar cantidad ingresada
             *-----------------------------------------*/
            default:

                Buzzer_ButtonClick(&buzzer1);

                cantidad_a_sumar = tecla - '0';

                LCD_I2C_SetCursor(3,18);
                LCD_I2C_WriteChar(tecla);

                break;
        }
    }
}
void Funcion_AgregarPastillas(uint8_t  pastillero_selecionado , uint8_t cantidad_a_sumar)
{
    const uint8_t ubicacion_memoria[] = {5, 6, 7, 8};
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[pastillero_selecionado-1]);//Leemos el dato de la memoria de -> comportimentx cantidad de pastillas
    EEPROM_UpdateByte(ubicacion_memoria[pastillero_selecionado-1],dato_memoria+cantidad_a_sumar);// Al pastillero indiviadual
    dato_memoria = EEPROM_ReadByte(2);//Leemos el valor de la direccion de -> cantidad de apstillas total
    EEPROM_UpdateByte(2,dato_memoria+ cantidad_a_sumar);// Cantidad de pastillas generales
}
void Guardar_CantPastillas(uint8_t  pastillero_selecionado , uint8_t cantidad_a_sumar)
{
    const uint8_t ubicacion_memoria[] = {5, 6, 7, 8};
    Funcion_AgregarPastillas(pastillero_selecionado ,cantidad_a_sumar);
    LCD_I2C_Clear();
    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("-- RECARGA EXITOSA--");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("PASTILLERO ");
    LCD_I2C_WriteUInt8(pastillero_selecionado,1);
    LCD_I2C_WriteString("LISTO");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Total actual: [");
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[pastillero_selecionado-1]);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString("]");
}
void Detallar_CantPastillas(uint8_t  tecla)
{
    const uint8_t ubicacion_memoria[] = {5, 6, 7, 8};
    LCD_I2C_Clear();
    LCD_I2C_SetCursor(1, 0);
    LCD_I2C_WriteString("-- RECARGA PAST. ");
    LCD_I2C_WriteUInt16(tecla,2,0);
    LCD_I2C_WriteString("--");
    LCD_I2C_SetCursor(2, 0);
    LCD_I2C_WriteString("Stock actual   : ");
    dato_memoria = EEPROM_ReadByte(ubicacion_memoria[tecla-1]);
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_SetCursor(3, 0);
    LCD_I2C_WriteString("A sumar        : 00");
    LCD_I2C_SetCursor(4, 0);
    LCD_I2C_WriteString("Guardar:[#] Salir:*");
}
void Detallar_Horarios(uint8_t numero,uint16_t hora,uint16_t minuto,uint16_t tipo)
{
    //1. 08:00 P1  5.18:00P4
    LCD_I2C_WriteUInt8(numero,1); // 1.
    LCD_I2C_WriteString(". ");
    dato_memoria = EEPROM_ReadByte(hora);//Hora
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString(":");
    dato_memoria = EEPROM_ReadByte(minuto);//Minuto
    LCD_I2C_WriteUInt8(dato_memoria,2);
    LCD_I2C_WriteString(" P");
    dato_memoria = EEPROM_ReadByte(tipo);//Tipo de compartimento
    LCD_I2C_WriteUInt8(dato_memoria,1);
}
void DataEEPROM(uint8_t data_memoria[40])
{
    for(uint8_t x = 0; x < 40; x++)
    {
        data_memoria[x] = EEPROM_ReadByte(x);
    }
}